// © Copyright 2005-2008, 2015 HP Development Company, L.P.

TaskName = "Firmware Update";

WebBrowserWindowTitle = "Firmware Update";

TaskTitleField = "Firmware Update";
TaskDescriptionField = "Firmware is the internal software used by your device. Click the \"Start\" button to go online to check for and install any needed updates to firmware.";
TaskStartButtonTitle = "Start";
